src/cf/InformationRegisters/СвязиКонтрагентЛид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентЛид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЛидов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПервичноеОбращение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноеОбращение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыЗавершенияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыЗавершенияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лиды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаметкиЗавершенияРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактыПеренесены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомпании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеуспешногоЗавершенияРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеуспешногоЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЛида</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтакты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РаботаСЛидами/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает представление лида с вариантом завершения "ПереведенВПокупателя"
// 
// Возвращаемое значение:
//  Строка - представление результата
//
Функция ПредставлениеРезультатаКачественногоЛида() Экспорт
	
	Возврат НСтр("ru = 'Качественный лид'");
	
КонецФункции

// Возвращает представление лида с вариантом завершения "НекачественныйЛид"
// 
// Возвращаемое значение:
//  Строка - представление результата
//
Функция ПредставлениеРезультатаНекачественногоЛида() Экспорт
	
	Возврат НСтр("ru = 'Некачественный лид'");
	
КонецФункции

// Возвращает представление незавершенного лида
// 
// Возвращаемое значение:
//  Строка - представление результата
//
Функция ПредставлениеРезультатаЛидаВРаботе() Экспорт
	
	Возврат НСтр("ru = 'В работе'");
	
КонецФункции

// Возвращает цвета областей под канбаном лидов, которые используются для переноса в них лидов
//
// Параметры:
//  ОттенокЦвета - Строка - "Зеленый", "Красный" или "Серый"
// 
// Возвращаемое значение:
//  Структура:
//   * ЦветРамки - Цвет - цвет рамки области
//   * ЦветТекста - Цвет - цвет текста области
//
Функция ЦветОбластиПодКанбаном(ОттенокЦвета = "") Экспорт
	
	Если ОттенокЦвета = "Зеленый" Тогда
		ЦветРамки = Новый Цвет(7, 178, 0);
		ЦветТекста = Новый Цвет(175, 212, 175);
	ИначеЕсли ОттенокЦвета = "Красный" Тогда
		ЦветРамки = Новый Цвет(255, 140, 140);
		ЦветТекста = Новый Цвет(230, 187, 187);
	Иначе
		ЦветРамки = Новый Цвет(160, 160, 160);
		ЦветТекста = Новый Цвет(190, 190, 190);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЦветРамки", ЦветРамки);
	Результат.Вставить("ЦветТекста", ЦветТекста);
	
	Возврат Результат;
	
КонецФункции

// Последние выбранные варианты перевода лида с формы лида.
// 
// Возвращаемое значение:
//  Структура:
//   * КнопкаПереводаПервичногоЛида - Строка
//   * КнопкаПереводаПовторногоЛида - Строка
//
Функция АктивныеКнопкиПереводаЛидаИзХранилища() Экспорт
	
	Результат = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Справочники.Лиды", "АктивныеКнопкиПереводаЛида");
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("КнопкаПереводаПервичногоЛида", "Покупатель");
		Результат.Вставить("КнопкаПереводаПовторногоЛида", "ЗаказПокупателя");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сохранить последние выбранные варианты перевода лида с формы лида.
//
// Параметры:
//  АктивныеКнопкиПереводаЛида - Структура:
//   * КнопкаПереводаПервичногоЛида - Строка
//   * КнопкаПереводаПовторногоЛида - Строка
//
Процедура СохранитьАктивныеКнопкиПереводаЛидаВХранилище(АктивныеКнопкиПереводаЛида) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
	"Справочники.Лиды", "АктивныеКнопкиПереводаЛида", АктивныеКнопкиПереводаЛида);
	
КонецПроцедуры

// Доступна работа с лидами
// 
// Возвращаемое значение:
//  Булево
//
Функция ЛидыДоступны() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьЛиды") И ПравоДоступа("Чтение", Метаданные.Справочники.Лиды);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПереводЛида

// Перевод лида в качественного
//
// Параметры:
//  ЛидОбъект - СправочникОбъект.Лиды
//  КонтрагентДляСвязи - СправочникСсылка.Контрагенты - если передается, то при переводе лид привязывается к этому
//                                                      контрагенту
// 
// Возвращаемое значение:
//  Структура:
//   * Контрагент - СправочникСсылка.Контрагенты
//   * Лид - СправочникСсылка.Лиды
//
Функция ПеревестиЛида(ЛидОбъект, КонтрагентДляСвязи = Неопределено) Экспорт
	
	Если ЛидОбъект.Вид = Перечисления.ВидыЛидов.ПовторноеОбращение Тогда
		
		ЛидОбъект.Заполнить(Новый Структура("ПереводВКачественныйЛид", Истина));
		Если Не ЛидОбъект.ПроверитьЗаполнение() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентДляСвязи) Тогда
			ЛидОбъект.ДополнительныеСвойства.Вставить("Контрагент", КонтрагентДляСвязи);
		КонецЕсли;
		
		ЛидОбъект.Записать();
		
		КонтрагентПослеПеревода = Справочники.Лиды.СвязанныйКонтрагент(ЛидОбъект.Ссылка);
		
	Иначе
		КонтрагентПослеПеревода = Справочники.Лиды.ПеревестиЛидаВПокупателя(ЛидОбъект);
		Если КонтрагентПослеПеревода = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Контрагент", КонтрагентПослеПеревода);
	Результат.Вставить("Лид", ЛидОбъект.Ссылка);
	
	Возврат Результат;
	
КонецФункции

// Проверка данных лида, прежде чем переводить его в качественного
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
// 
// Возвращаемое значение:
//  Булево
//
Функция МожноПеревестиВКлиента(Лид) Экспорт
	
	Результат = Истина;
	КонтактыЛида = Справочники.КонтактыЛидов.КонтактыЛида(Лид);
	
	Для каждого ДанныеКонтакта Из КонтактыЛида Цикл
		
		Если ЗначениеЗаполнено(ДанныеКонтакта.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Поле ""Имя Фамилия"" заполнено не у всех контактов лида'"));
		Результат = Ложь;
		
	КонецЦикла;
	
	ЛидОбъект = Лид.ПолучитьОбъект();
	Если НЕ ЛидОбъект.ПроверитьЗаполнение() Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаНаФормах

// Действия после чтения заказа для работы с лидами
//
// Параметры:
//  Ссылка - ДокументСсылка.ЗаказПокупателя
//  ЭлементЛидОснование - ДекорацияФормы - куда помещается ссылка на лид-основание заказа
//
Процедура ДействияПослеЧтенияЗаказа(Ссылка, ЭлементЛидОснование) Экспорт
	
	ЛидОснование = РегистрыСведений.СвязиКонтрагентЛид.ЛидПоЗаказу(Ссылка);
	Если Не ЗначениеЗаполнено(ЛидОснование) Тогда
		Возврат;
	КонецЕсли;
	
	НавигационнаяСсылкаЛида = ПолучитьНавигационнуюСсылку(ЛидОснование);
	ПредставлениеЛида = Строка(ЛидОснование);
	
	ЭлементЛидОснование.Видимость = Истина;
	ЭлементЛидОснование.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
	НСтр("ru = 'Заказ создан от лида <a href=""%1"">%2</a>'"), НавигационнаяСсылкаЛида, ПредставлениеЛида);
	
КонецПроцедуры

#КонецОбласти

#Область Заявки

// Отменить все заявки лида в работе по лиду
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//  ДанныеОтмены - Структура:
//   * ПричинаОтмены - СправочникСсылка.ПричиныОтменыЗаказа
//   * Заметки - Строка
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗаказПокупателя - заявки лида в работе
//
Функция ОтменитьВсеЗаявкиЛидаВРаботе(Лид, ДанныеОтмены) Экспорт
	
	Заявки = РаботаСЗаявками.ЗаявкиЛидаВРаботе(Лид);
	
	Если Не Заявки.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого Заявка Из Заявки Цикл
		
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		
		Попытка
			ЗаявкаОбъект.Заблокировать();
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось заблокировать объект %1
			|
			|Описание ошибки:
			|%2'"),
			ЗаявкаОбъект,
			ТекстОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Блокировки.Ошибка'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказПокупателя, ЗаявкаОбъект,
			ТекстОшибки);
			
			ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
			
		КонецПопытки;
		
		Если ЗаявкаОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд Тогда
			СостояниеЗаказа = Справочники.СостоянияЗаказНарядов.Завершен;
		Иначе
			СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
		КонецЕсли;
		
		ЗаявкаОбъект.СостояниеЗаказа = СостояниеЗаказа;
		ЗаявкаОбъект.ВариантЗавершения = ПредопределенноеЗначение("Перечисление.ВариантыЗавершенияЗаказа.Отменен");
		ЗаявкаОбъект.ПричинаОтмены = ДанныеОтмены.ПричинаОтмены;
		ЗаявкаОбъект.Заметки = ДанныеОтмены.Заметки;
		
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
	КонецЦикла;
	
	Возврат Заявки;
	
КонецФункции

#КонецОбласти

#Область Заказы

Функция ЕстьЗаказПоЛиду(Лид, Заказы) Экспорт
	
	Если ТипЗнч(Заказы) = Тип("Массив") Тогда
		
		ДанныеЗаказов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Заказы, "Лид");
		Для Каждого КлючЗначение Из ДанныеЗаказов Цикл
			Если КлючЗначение.Значение = Лид Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Возврат (Лид = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказы, "Лид"));
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Проверка лида на завершение по реквизитам
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
// 
// Возвращаемое значение:
//  Булево
//
Функция ЛидЗавершен(Лид) Экспорт
	
	ВариантЗавершения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Лид, "ВариантЗавершения");
	Возврат ЗначениеЗаполнено(ВариантЗавершения);
	
КонецФункции

// Функция - Сведения о лиде для печати
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//  ДатаПериода - Дата
// 
// Возвращаемое значение:
//  Структура - См. ПечатьДокументовУНФ.НовыеСведенияОЮрФизЛице
//
Функция СведенияОЛидеДляПечати(Лид, ДатаПериода) Экспорт
	
	Возврат Справочники.Лиды.СведенияОЛидеДляПечати(Лид, ДатаПериода);
	
КонецФункции

Функция СвязанныйКонтрагент(Лид) Экспорт
	
	Возврат Справочники.Лиды.СвязанныйКонтрагент(Лид);
	
КонецФункции

Функция СвязанныеКонтрагенты(Лиды) Экспорт
	
	Возврат Справочники.Лиды.СвязанныеКонтрагенты(Лиды);
	
КонецФункции

#КонецОбласти
